meetings/simon/work_summary_20220530.org
#+TITLE: Progress update 2022-05-30
#+AUTHOR: Simon Sundberg

#+OPTIONS: ^:nil 
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_INIT_OPTIONS: width:1600, height:1000, slideNumber:"c/t"

* Overview
- Mainly worked on IMC paper
- Caught up a bit on course work and inst. dut.
- Had another look at Toke's libxdp PR and approved it, now merged
  - It should now be possible to load ePPing + other XDP programs on same interface

* The "code complexity" of ePPing
- On kernel version 5.17 ePPing does not pass the verifier if compiled with LLVM-14
  - The verifier hits it 1m instruction limit while going through all branches of the code (code itself is ~1500 instructions)
- Turns out that this is issue if affected both by LLVM version and kernel version
- Idea is to refactor code to use per-function verification
  - Still a bit unclear if this will even be possible...
  - ...will simply try and see
  - backup plan may be to use bpf_loop()

** "Complexity" under various configurations   

| Env                         | Egress | Ingress |
|-----------------------------+--------+---------|
| 5.15, LLVM-13               | 367k   | 365k    |
| 5.15, LLVM-14               | 218k   | 213k    |
| 5.16, LLVM-13               | 468k   | 626k    |
| 5.16, LLVM-14               | 726k   | 1m+     |
|-----------------------------+--------+---------|
| 5.16, LLVM-13, v3           | 335k   | 394k    |
| 5.16, LLVM-14, v3           | 756k   | 1m+     |
| 5.16, LLVM-13, no loops     | 123k   | 200k    |
| 5.16, LLVM-14, no loops     | 242k   | 348k    |
| 5.16, LLVM-13, only parsing | 66k    | 66k     |
| 5.16, LLVM-14, only parsing | 66k    | 66k     |

* Work on improving sampling
- We discussed what to work on next during the last Red Hat meeting
  - Ended up with improving how ePPing samples and reports RTTs
- There are many possible solutions here
  - Report only abnormally high RTTs
  - Report min/max/mean each interval
  - Report histogram every interval
  - Some probabalistic approach to capture RTT distribution
- Will think a bit about it, and maybe we can discuss in next week?

* Other
- Need to update ISP soon
  - Will likely require a large rewrite of goals section (very far behind schedule)
  - Need to rebalance courses to account of statistics course
  - Need to add goal matrix
- Been invited to Red Hat research day in Brno (15/9)
- Have 3 exam tasks in the data plane programming course
